

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Реквизит1 = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеПоОтгрузкеНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	НомерВнешнегоДокумента = Реквизит1.ТранспортировкаИГруз.ВыгрузитьКолонку("НомерВнешнегоДокумента");
	
	ДанныеПоОтгрузке = ОбработкаОбъект.ВыполнитьПолучение_ДанныеПоОтгрузке("ЦПЗ_УТ", НомерВнешнегоДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоОтгрузке(Команда)
	ПолучитьДанныеПоОтгрузкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокСписанияТМЦНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СписокСписанияТМЦ = ОбработкаОбъект.ВыполнитьПолучение_СписаниеТМЦ_Список("ЦПЗ_УТ", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокСписанияТМЦ(Команда)
	ПолучитьСписокСписанияТМЦНаСервере();
КонецПроцедуры
