
Функция ПодготовитьСобытиеПрямогоОбмена(ИмяСобытия = "") Экспорт
	
	ЗначениеВозврата = новый Структура();
	ЗначениеВозврата.Вставить("УзелПрямогоОбменаДанными","");
	ЗначениеВозврата.Вставить("ИмяСобытия", ИмяСобытия);
	ЗначениеВозврата.Вставить("Период", ТекущаяДата());
	ЗначениеВозврата.Вставить("Результат", "");
	
	Возврат ЗначениеВозврата;
	
КонецФункции

Процедура ЗаписатьСобытиеПрямогоОбмена(ДанныеУзла, ДанныеСобытия) Экспорт
	
	МенеджерРегистра = РегистрыСведений.РегистрацияСобытийПрямогоОбменаДанными;
	МенеджерЗаписи = МенеджерРегистра.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.УзелПрямогоОбменаДанными = ДанныеУзла;
	МенеджерЗаписи.ИмяСобытия = ДанныеСобытия.ИмяСобытия;
	МенеджерЗаписи.Период = ДанныеСобытия.Период;
	МенеджерЗаписи.Результат = ДанныеСобытия.Результат;
	
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры