
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Версия  = ОбработкаОбъект.Версия();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

#Область ТестированиеОбмена

&НаСервере
Процедура ОтправитьСообщение_ЗаявкаНаДСНаСервере()
	
	МенеджерПрямогоОбмена = Обработки.МенеджерПрямогоОбмена_УТ.Создать();
	
	МенеджерПрямогоОбмена.ВыполнитьОтправку_ЗаявкаНаДС(ПрямойОбмен_ЗаявкаНаРасходованиеДС, "БП3");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение_ЗаявкаНаДС(Команда)
	ОтправитьСообщение_ЗаявкаНаДСНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщение_ЗаявкакНаДС_СтатустНаСервере()
	
	МенеджерПрямогоОбмена = Обработки.МенеджерПрямогоОбмена_УТ.Создать();
	
	МенеджерПрямогоОбмена.ВыполнитьОтправку_ЗаявкаНаДС_Статус(ПрямойОбмен_ЗаявкаНаРасходованиеДС, "БП3");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение_ЗаявкакНаДС_Статуст(Команда)
	ОтправитьСообщение_ЗаявкакНаДС_СтатустНаСервере();
КонецПроцедуры

#КонецОбласти

#КонецОбласти
