
#Область ОбработчикиСобытийФормы


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьИмяСтрокиПодключенияУзла(Команда)
	УстановитьИмяСтрокиПодключенияУзлаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьХэшИдентификаторУзла(Команда)
	ОбновитьХэшИдентификаторУзлаНаСервере();		
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСобытиеПрямогоОбмена(Команда)
		
	УзелИсточник = Объект.Ссылка;
	УзелПолучатель = Элементы.ДоступныеСобытия.ТекущиеДанные.УзелОбмена;
	ИмяМетода = Элементы.ДоступныеСобытия.ТекущиеДанные.ИмяМетода;
	ИмяВызываемогоСобытия = Элементы.ДоступныеСобытия.ТекущиеДанные.ИмяВызываемогоСобытия; 
	ИмяПредопределенногоМенеджераОбмена = Объект.ИмяПредопределенногоМенеджераОбмена;

	ВыполнитьСобытиеПрямогоОбменаНасервере(УзелИсточник, УзелПолучатель, ИмяМетода, ИмяВызываемогоСобытия, ИмяПредопределенногоМенеджераОбмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьХэшИдентификаторУзлаНаСервере()
	
	Объект.Код = Обработки.УправлениеНастройкамиПрямогоОбмена.СформироватьХешИдентификаторУзла(Объект.ИмяСтрокиПодключенияУзла);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСобытиеПрямогоОбменаНасервере(УзелИсточник, УзелПолучатель, ИмяМетода, ИмяВызываемогоСобытия, ИмяПредопределенногоМенеджераОбмена)
	
	ОбработкаОбъект = Вычислить("Обработки." + ИмяПредопределенногоМенеджераОбмена + ".Создать()");//РеквизитФормыВЗначение("Объект");
	
	Результат = Вычислить("ОбработкаОбъект." + ИмяМетода + "(УзелПолучатель.Наименование)");
	
	Если Результат.Отказ = Истина Тогда
		Сообщить(Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИмяСтрокиПодключенияУзлаНаСервере()
	Объект.ИмяСтрокиПодключенияУзла = СтрокаСоединенияИнформационнойБазы();
КонецПроцедуры

#КонецОбласти

